import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-reviews',
  templateUrl: './reviews.component.html',
  styleUrls: ['./reviews.component.scss']
})
export class ReviewsComponent implements OnInit {

  reviews = [
    {
      img: '/assets/img/review-5.jpg',
      active: true,
      text: 'Полностью доволен сотрудничеством с @eddycars_usa начиная от грамотных советов при подборе, заканчивая рекомендациями по ремонту/сертификации и постановке на учёт. За время работы не возникло ни одного сомнения в компетентности, никаких скрытых комиссий, по финансам все ровно так, как было просчитано сразу после покупки авто на аукционе. Общее впечатление о работе 10 из 10 :) рекомендую 👍'
    },
    {
      img: '/assets/img/review-6.jpg',
      active: false,
      text: 'Всё очень круто сделали! Я доволен сотрудничеством с @eddycars_usa Эти ребята не только профессионалы и любят автомобили, но и очень порядочные люди. Это большая редкость! И я очень рад нашему знакомству. 😎'
    },
    {
      img: '/assets/img/review-7.jpg',
      active: false,
      text: 'Спасибо за проделанную работу! Получил отличный авто за вменяемые деньги🚙. Долго выбирал компанию, которой можно довериться, сравнивал просчеты и вы оправдали все мои ожидания! Подбирали 3 недели, бюджет был ограничен, брали участие в торгах за множество машин. Очень много машин не брались торговать, чувствовал индивидуальный подход, а не желание быстрее «продать». Сроки доставки как и обещали, 18 сентября выиграли на аукционе, 12 декабря авто был у меня. По оплатам все прозрачно, получил предварительный рассчет по машине ещё перед торгами за авто, никаких доп платежей. Рекомендую! и ещё раз спасибо😊'
    },
    {
      img: '/assets/img/review-8.jpg',
      active: false,
      text: 'Хлопці, ви реально круті, і тепер усіх своїх знайомих які будуть купувати авто, я буду відсилати саме до вас. Мені дуже сподобалося працювати з цією фірмою, бо в ній працюють професійні та відповідальні люди. Дуже добре допомагали мені з купівлею авто на всіх етапах, починаючи з пошуку авто, закінчуючи доставкою йог прямо в моє місто. Машиною я дуже задоволена, бо вона по всім характеристикам відповідає повністю всім моїм бажанням.'
    },
    {
      img: '/assets/img/review-9.jpg',
      active: false,
      text: 'Все было отлично, великолепное сопровождение на всех этапах покупки. Бывало даже что и в полночь отвечали на вопросы)00 машина огонь, купили именно ее исходя из рекомендаций Эдуарда. Всем рекомендую. 🔥🔥🔥'
    },
    {
      img: '/assets/img/review-10.jpg',
      active: false,
      text: 'Эдуард, спасибо большое! Все получилось. Машиной очень доволен👏👏👏'
    },
    {
      img: '/assets/img/review-11.jpg',
      active: false,
      text: 'Спасибо вам большое за крутую работу! Высший сервис! Второй раз сотрудничаю с ребятами, очень доволен результатом) они топ 🔝🔝🔝'
    },
  ];

  activeReview = 0;

  constructor() { }

  ngOnInit(): void {
  }

}
