import { Component, OnInit, HostListener, ElementRef, ViewChildren, QueryList } from '@angular/core';
import { ActivatedRoute } from '@angular/router';
import { BehaviorSubject, interval } from 'rxjs';
import { Subject } from 'rxjs';
import { scan, switchMap, takeWhile, takeUntil } from 'rxjs/operators';
import { ViewportScroller } from '@angular/common';

@Component({
  selector: 'app-services',
  templateUrl: './services.component.html',
  styleUrls: ['./services.component.scss']
})
export class ServicesComponent implements OnInit {

  arrMenu = [
    'Подбор',
    'Проверка',
    'Торги',
    'Покупка',
    'Доставка к Порту',
    'Морской фрахт',
    'Прибытие в Украину',
    'Таможенное оформление',
    'Доставка из Одессы',
    'Ремонт',
    'Сертификация',
    'Регистрация'
  ];

  service = [
    {
      img: 'service-img-5.svg',
      title: 'Подбор',
      text: [
        'Поиск лучших вариантов на аукционе под запрос клиента'
      ],
      fragment: 'podbor'
    },
    {
      img: 'service-img-7.svg',
      title: 'Проверка',
      text: ['Изучение истории, проверка продавца, экспертная оценка, исключение  возможных рисков'],
      fragment: 'proverka'
    },
    {
      img: 'service-img-4.svg',
      title: 'Покупка',
      text: ['Просчет стоимости лота и всей расходной части, участие и победа в торгах'],
      fragment: 'pokupka'
    },
    {
      img: 'service-img-2.svg',
      title: 'Доставка',
      text: [
        'Транспортировка на склад в США, фотоотчеты, подготовка необходимых документов, погрузка, отправка в Украину'
      ],
      fragment: 'dostavka'
    },
    {
      img: 'service-img-8.svg',
      title: 'Таможня',
      text: ['Разгрузка контейнера и таможенное оформление автомобиля клиента в кратчайшие сроки'],
      fragment: 'customs'
    },
    {
      img: 'service-img-1.svg',
      title: 'Ремонт',
      text: [
        'Подбор и доставка необходимых запчастей, организация процесса ремонта, контроль на всех этапах'
      ],
      fragment: 'remont'
    },
    {
      img: 'service-img-6.svg',
      title: 'Сертификация',
      text: [
        'Организация процесса сертификации в кратчайшие сроки и по выгодной цене'
      ],
      fragment: 'cert'
    },
    {
      img: 'service-img-3.svg',
      title: 'Постановка на учет',
      text: [
        'Регистрация транспортного средства клиента в сервисном центре и доставка в любую точку Украины'
      ],
      fragment: 'uchet'
    },
    {
      img: 'service-img-9.png',
      title: 'Авто в кредит',
      text: [
        'Возможность получения кредитных средств для покупки авто из США на срок до 7 лет'
      ],
      fragment: 'kredit'
    },
    {
      img: 'service-img-9.png',
      title: 'Авто в кредит',
      text: [
        'Возможность получения кредитных средств для покупки авто из США на срок до 7 лет'
      ],
      fragment: 'kredit'
    },
    {
      img: 'service-img-9.png',
      title: 'Авто в кредит',
      text: [
        'Возможность получения кредитных средств для покупки авто из США на срок до 7 лет'
      ],
      fragment: 'kredit'
    },
    {
      img: 'service-img-9.png',
      title: 'Авто в кредит',
      text: [
        'Возможность получения кредитных средств для покупки авто из США на срок до 7 лет'
      ],
      fragment: 'kredit'
    }
  ];

  expand = null;
  currentSection: BehaviorSubject<string> = new BehaviorSubject('podbor');
  sections: string[] = ['podbor','proverka','torgi','pokupka','dostavka','freight','odessa','customs','address','remont','cert','uchet'];
  showId = 0;

  scrollToSource: Subject<any> = new Subject<any>();
  arrFaq = [
    {
      show: false,
      question: 'Можно ли купить авто без повреждений?',
      answer: [
        'Да, из США без проблем можно привезти абсолютно целый автомобиль. Покупка авто без повреждений наиболее актуальна для электро автомобилей, так как максимальная выгода достигается за счет льготных условий, предоставленных для ввоза электрических авто в Украину. Такое авто можно приобрести с закрытого дилерского аукциона Manheim.',
        'Также, наша организация может приобрести и доставить для Вас целый автомобиль с бензиновым/дизельным/гибридным двигателем с аукциона Manheim.. Однако цена такого авто ощутимо выше, по сравнению с аналогичными автомобилями с минимальными повреждениями со страховых аукционов.'
      ]
    },
    {
      show: false,
      question: 'Почему привезти авто из США выгодно?',
      answer: [
        'Основная часть автомобилей из США, которые прибывают в Украину, приобретаются на страховых аукционах с повреждениями разной степени.',
        'Стоимость восстановительных работ в США довольно высокая, за счет этого автомобили, даже с минимальными повреждениями навесных элементов, очень часто попадают на аукционы. В свою очередь, в Украине восстановление такого авто в 4-5 раз дешевле, с учетом стоимости работ и запчастей. В то же время, характер повреждений авто, представленных на аукционе, может быть не только результатом участия в ДТП. На аукционных площадках большой выбор автомобилей с повреждениями после града, кражи, вандализма и т.д.',
        'Цены на рынке авто в США, как б\у так и новых, в целом ниже, чем в Европе и Украине.',
        'Все автомобили в США застрахованы в обязательном порядке. Когда авто попадает в ДТП, как правило, страховая компания возмещает ущерб владельцу и выставляет автомобиль на страховой аукцион. ',
        'Страховой бизнес в США находится совсем на другом уровне и, как следствие, иногда, из-за специфики законов, авто даже без повреждений попадает на аукцион.',
        'Кроме того, налоговые ставки на растаможку авто в Украине с 2017 года позволяют очень выгодно ввозить и таможить автомобили 2011-2021 года выпуска из США.'
      ]
    },
    {
      show: false,
      question: 'В чем преимущество рынка автомобилей в США по сравнению с украинским рынком?',
      answer: [
        'Во-первых - цена. Все авто, которые завезены из США и восстановлены, продаются на вторичном рынке Украины в среднем с наценкой 15%-35% от затраченных средств на это авто.',
        'Во-вторых – состояние. Реалии сегодняшнего вторичного рынка таковы, что 80% автомобилей на рынке Украины 2011-2021 года выпуска были привезены из США. Соответственно, были куплены на страховых аукционах, с теми или иными повреждениями. Разбег цены на одну и ту же модель с одинаковыми характеристиками на аукционе и на вторичном рынке Украины может отличаться в разы. ',
        'С чем связана такая ситуация? На стоимость лота на аукционе влияют следующие факторы:',
        '- степень повреждений',
        '- история автомобиля',
        '- пробег ',
        '- другие нюансы',
        'Соответственно, «автобизнесмены» стремятся купить авто по более низкой цене. Как правило, эти авто имеют довольно серьезные повреждения, большой пробег или другие «подводные камни».',
        'Далее, естественно, идет процесс восстановления. Тут также огромный разбег и стоимость восстановления зависит от следующих факторов:',
        '- применяемых запчастей (неоригинальные или дефектные запчасти порой в 3-4 раза дешевле оригинальных)',
        '- качества работы',
        '- замены или восстановления (в качестве альтернативы) тех или иных узлов. ',
        'Естественно, с целью экономии, процесс восстановления автомобиля не производится должным образом. В итоге, очень часто, на продажу выставляются некачественно восстановленные автомобили после серьезных ДТП. Иногда, следы некачественного ремонта не скрыть, однако, очень часто, это невозможно диагностировать при осмотре авто.',
        'Последствия покупки такого авто на украинском рынке плачевны и как правило влекут за собой: ',
        '- небезопасные автомобили',
        '- финансовые затраты в первые полгода эксплуатации авто.',
        '- большие проблемы и финансовые потери при последующей продаже автомобиля',
        'В случае же, когда Вы приобретаете авто с аукциона, вы получаете:',
        '- больший выбор',
        '- возможность самим определить допустимые повреждения',
        '- уверенность в родном пробеге и чистой истории',
        '- возможность выкупить авто по выгодной ставке',
        '- консультации наших экспертов касательно степени повреждений того или иного лота',
        '- возможность качественно восстановить авто без ущерба для безопасности и надежности Вашего транспортного средства',
        'В-третьих – комплектация. За счет высокого уровня жизни в США и большей покупательской способности, автопроизводители поставляют на рынок США автомобили в лучших комплектациях, по сравнению с такими же автомобилями в Европе и Украине.',
        'В-четвертых - родной пробег и прозрачная история. Абсолютно нормальной практикой в Украине является «скручивание» пробега на автомобиле перед продажей. Эта процедура стоит копейки, а законодательно отсутствует любая реальная ответственность за такие действия. ',
        'В США ситуация обратная. Существует уголовная ответственность за вмешательство в показание одометра. Да и сам менталитет американцев не предполагает даже мысли о скрутке пробега. Благодаря официальным базам США, все показания одометра фиксируются при каждом техническом осмотре авто. Любое несоответствие по пробегу авто сразу фиксируется. За счет этого, при покупке автомобиля из США, можно быть на 100% уверенным в родном пробеге.',
        'Также огромным плюсом является то, что в США довольно маленькие пробеги, в отличии от Европы. Это дает возможность выбрать хоть и 5-7 летний авто, но с минимальным пробегом'
      ]
    },
    {
      show: false,
      question: 'Можно ли отказаться от авто? ',
      answer: [
        'Можно, до того, как автомобиль будет выигран на аукционе. В противном случае клиент теряет залоговый депозит, который вносится после подписания договора между клиентом и компанией. '
      ]
    },
    {
      show: false,
      question: 'Зачем нужен депозит? ',
      answer: [
        'Депозит является страховкой от возможного отказа клиента от уже приобретенного автомобиля или неоплаты клиентом купленного лота в оговоренные сроки. Все аукционы имеют систему штрафов в случае отказа или задержки оплаты за выигранный лот. Депозит позволит покрыть издержки компании в случае неисполнения обязательств клиентом.',
        'Депозит возвращается клиенту, в случае отказа от покупки автомобиля до момента победы на торгах.'
      ]
    },
    {
      show: false,
      question: 'Какие гарантии?  ',
      answer: [
        'Мы гарантируем выполнение взятых на себя обязательств, прописанных в договоре. Договор поставки транспортного средства имеет юридическую силу с момента подписания обеими сторонами и прекращается по факту выполнения всех обязательств с обеих сторон. ',
        'Согласно договору, мы несем материальную ответственность за Ваш груз. Груз застрахован на всех этапах доставки до Украины.'
      ]
    },
    {
      show: false,
      question: 'Возможно ли растаможить авто в своем городе самому?',
      answer: [
        'Да, в случае, если клиент предпочитает таможить авто не в порту Одессы, мы доставим авто в любой другой город.'
      ]
    },
    {
      show: false,
      question: 'Как вы просчитываете стоимость ремонта по фото? Какие гарантии, что ремонт авто не потянет на «кругленькую сумму»?',
      answer: [
        'Конечно, точную стоимость ремонта автомобиля оценить по фотографиям нельзя. Однако, основываясь на многолетнем опыте в этом деле, наши эксперты оценивают приблизительную стоимость ремонта с вероятностью в 80-90 (а часто и 100) процентов. Также мы всегда рекомендуем закладывать определенную сумму (которую также определяют наши эксперты) на непредвиденные расходы, в зависимости от класса автомобиля, стоимости деталей и характера повреждений. ',
        'В процессе подбора мы всегда предлагаем лоты с максимально понятными повреждениями, которые максимально точно можно оценить.',
        'Как показывает практика, в итоге, согласно такой калькуляции, экономия составляет 10-30% от рыночной стоимости авто.'
      ]
    },
    {
      show: false,
      question: 'С какими повреждениями вы НЕ советуете брать автомобили?',
      answer: [
        'Мы всегда стараемся максимально способствовать выгодной покупке действительно ХОРОШЕГО И БЕЗПРОБЛЕМНОГО авто, однако окончательное решение остается всегда за клиентом.',
        'Мы не советуем покупать утопленников, автомобили без видимых ударов/повреждений.',
        'Также, мы советуем рассматривать автомобили не старше 8 лет, с минимальным пробегом.',
        'Кроме того, мы не советуем покупать СИЛЬНО разбитые авто даже за условные «копейки», так как практика показывает, что в процессе ремонта, вся эта экономия при покупке с аукциона выльется в дополнительные ремонтные работы.'
      ]
    },
    {
      show: false,
      question: 'Можно ли осуществить более подробный осмотр автомобиля на площадке Вашим представителем?',
      answer: [
        'Да, по желанию клиента, мы закажем инспекцию, и представитель аукциона сможет сделать подробный фотоотчет повреждений конкретного лота. Стоимость такой услуги – 100-180 долларов за каждый осмотр. Мы рекомендуем пользоваться этой услугой при покупке премиальных авто, стоимость которых на аукционе США будет составлять от 20 000 долларов.'
      ]
    },
    {
      show: false,
      question: 'Какой минимальный бюджет на покупку авто из США?',
      answer: [
        'Минимальный бюджет в районе 6000 $ с учетом всех расходов без учета ремонта'
      ]
    },
    {
      show: false,
      question: 'Какие сроки?',
      answer: [
        'Средний срок получения авто – 8-10 недель с момента покупки авто на аукционе до момента получения растаможенного авто в Вашем городе.'
      ]
    },
    {
      show: false,
      question: 'От чего зависит стоимость доставки?',
      answer: [
        'Стоимость доставки каждого автомобиля зависит от расположения площадки аукциона, на которой он находится, а также порта отправки из США.',
        'Для просчета стоимости доставки вы можете воспользоваться калькулятором доставки на нашем сайте.'
      ]
    },
    {
      show: false,
      question: 'Как рассчитать стоимость таможенных платежей?',
      answer: [
        'Сумма пошлин зависит от цены покупки/года выпуска/типа топлива/объема двигателя каждого конкретного лота.',
        'Для расчета стоимости таможенных платежей Вы можете воспользоваться калькулятором растаможки на нашем сайте.'
      ]
    }

  ];
  fragment: any = '';
  componentDestroyed$: Subject<boolean> = new Subject();
  scrollPosition = 0;
  constructor(
    public route: ActivatedRoute,
  ) {
    document.addEventListener('scroll', () => {

      this.scrollPosition = window.pageYOffset;
      console.log(this.scrollPosition);
      // this.fragment = '';
      this.keepTrack();
    }, {
      passive: true
    })
  }

  ngOnInit(): void {

    this.scrollToSource.pipe(switchMap(targetYPos =>
      interval(100).pipe( //interval just creates an observable stream corresponding to time, this emits every 1/10th of a second. This can be fixed or make it dynamic depending on the distance to scroll
        scan((acc, curr) => acc + 5, window.pageYOffset), // scan takes all values from an emitted observable stream and accumulates them, here you're taking the current position, adding a scroll step (fixed at 5, though this could also be dynamic), and then so on, its like a for loop with +=, but you emit every value to the next operator which scrolls, the second argument is the start position
        takeWhile(val => val < targetYPos)) // stop when you get to the target
    )).subscribe(position => {
      console.log(position);
      window.scrollTo(0, position);
    }); // here is where you scroll with the results from scan

    this.route.fragment.pipe(
      takeUntil(this.componentDestroyed$)
    ).subscribe(
      (fragment) => {
        console.log(fragment);
        this.fragment = fragment;
      }
    );

    this.currentSection.subscribe(
      (res) => {
        console.log("current section: ", res)
      }
    )

  }

  sliceArr(mode: number, arr: any[]) {
    return mode === 0 ? arr.slice(0, 6) : arr.slice(7, 13);
  }



  keepTrack() {
    const viewHeight = window.innerHeight;
    for (var section of this.sections) {
     const element = document.getElementById(section);
      if (element != null) {
       const rect = element.getBoundingClientRect();
       if (rect.top >= 0 && rect.top < viewHeight / 2)
         {this.currentSection.next(section);}
      }
     }
   }

  getTargetElementRef(currentYPos: any) {
    // you need to figure out how this works
    // I can't comment much on it without knowing more about the page
    // but you inject the host ElementRef in the component / directive constructor and use normal vanillaJS functions to find other elements
  }

  scrollTo(target: ElementRef): void {
    // this assumes you're passing in an ElementRef, it may or may not be appropriate, you can pass them to functions in templates with template variable syntax such as: <div #targetDiv>Scroll Target</div> <button (click)="scrollTo(targetDiv)">Click To Scroll</button>
    this.scrollToSource.next(target);
  }

  ngOnDestroy() {
    this.componentDestroyed$.next(true);
    this.componentDestroyed$.complete();
  }


  //switch map takes the last value emitted by an observable sequence, in this case, the user's latest scroll position, and transforms it into a new observable stream


}
