import { Component, OnInit, HostListener, ElementRef, ViewChildren, QueryList } from '@angular/core';
import { ActivatedRoute } from '@angular/router';
import { BehaviorSubject, interval } from 'rxjs';
import { Subject } from 'rxjs';
import { scan, switchMap, takeWhile, takeUntil } from 'rxjs/operators';
import { ViewportScroller } from '@angular/common';

@Component({
  selector: 'app-services',
  templateUrl: './services.component.html',
  styleUrls: ['./services.component.scss']
})
export class ServicesComponent implements OnInit {

  arrMenu = [
    'Підбір',
    'Перевірка',
    'Торги',
    'Придбання',
    'Доставка до Порту',
    'Морський фрахт',
    'Прибуття на територію України',
    'Митне оформлення',
    'Адресна доставка з порту прибуття',
    'Ремонт',
    'Сертифікація',
    'Реєстрація'
  ];

  service = [
    {
      img: 'service-img-5.svg',
      title: 'Підбір',
      text: [
        'Поиск лучших вариантов на аукционе под запрос клиента'
      ],
      fragment: 'podbor'
    },
    {
      img: 'service-img-7.svg',
      title: 'Перевірка',
      text: ['Изучение истории, проверка продавца, экспертная оценка, исключение  возможных рисков'],
      fragment: 'proverka'
    },
    {
      img: 'service-img-4.svg',
      title: 'Придбання',
      text: ['Просчет стоимости лота и всей расходной части, участие и победа в торгах'],
      fragment: 'pokupka'
    },
    {
      img: 'service-img-2.svg',
      title: 'Доставка до Порту',
      text: [
        'Транспортировка на склад в США, фотоотчеты, подготовка необходимых документов, погрузка, отправка в Украину'
      ],
      fragment: 'dostavka'
    },
    {
      img: 'service-img-8.svg',
      title: 'Таможня',
      text: ['Разгрузка контейнера и таможенное оформление автомобиля клиента в кратчайшие сроки'],
      fragment: 'customs'
    },
    {
      img: 'service-img-1.svg',
      title: 'Ремонт',
      text: [
        'Подбор и доставка необходимых запчастей, организация процесса ремонта, контроль на всех этапах'
      ],
      fragment: 'remont'
    },
    {
      img: 'service-img-6.svg',
      title: 'Сертификация',
      text: [
        'Организация процесса сертификации в кратчайшие сроки и по выгодной цене'
      ],
      fragment: 'cert'
    },
    {
      img: 'service-img-3.svg',
      title: 'Постановка на учет',
      text: [
        'Регистрация транспортного средства клиента в сервисном центре и доставка в любую точку Украины'
      ],
      fragment: 'uchet'
    },
    {
      img: 'service-img-9.png',
      title: 'Авто в кредит',
      text: [
        'Возможность получения кредитных средств для покупки авто из США на срок до 7 лет'
      ],
      fragment: 'kredit'
    },
    {
      img: 'service-img-9.png',
      title: 'Авто в кредит',
      text: [
        'Возможность получения кредитных средств для покупки авто из США на срок до 7 лет'
      ],
      fragment: 'kredit'
    },
    {
      img: 'service-img-9.png',
      title: 'Авто в кредит',
      text: [
        'Возможность получения кредитных средств для покупки авто из США на срок до 7 лет'
      ],
      fragment: 'kredit'
    },
    {
      img: 'service-img-9.png',
      title: 'Авто в кредит',
      text: [
        'Возможность получения кредитных средств для покупки авто из США на срок до 7 лет'
      ],
      fragment: 'kredit'
    }
  ];

  expand = null;
  currentSection: BehaviorSubject<string> = new BehaviorSubject('podbor');
  sections: string[] = ['podbor','proverka','torgi','pokupka','dostavka','freight','odessa','customs','address','remont','cert','uchet'];
  showId = 0;

  scrollToSource: Subject<any> = new Subject<any>();
  arrFaq = [
    {
      show: false,
      question: 'Чи можна купити авто без пошкоджень?',
      answer: [
        'Так, в США без проблем можливо придбати абсолютно цілий автомобіль. Купівля авто без пошкоджень найбільш актуальна для електроавтомобілів, оскільки максимальна вигода досягається за рахунок пільгових умов, наданих для ввезення електричних авто в Україну. Таке авто можна придбати із закритого дилерського аукціону Manheim.',
        'Також, наша компанія може придбати та доставити для Вас цілий автомобіль з бензиновим/дизельним/гібридним двигуном з аукціону Manheim. Однак ціна такого авто відчутно вища, порівняно з аналогічними автомобілями з мінімальними пошкодженнями зі страхових аукціонів.'
      ]
    },
    {
      show: false,
      question: 'Чому привезти авто зі США вигідно?',
      answer: [
        'Основна частина автомобілів зі США, які прибувають в Україну, купуються на страхових аукціонах з пошкодженнями різного ступеня.',
        'Вартість відновлювальних робіт у США доволі висока, за рахунок цього автомобілі, навіть з мінімальними пошкодженнями навісних елементів, дуже часто потрапляють на аукціони. Своєю чергою, в Україні відновлення такого авто в 4-5 разів дешевше, з урахуванням вартості робіт і запчастин. Водночас, характер пошкоджень авто, представлених на аукціоні, може бути не тільки результатом участі в ДТП. На аукціонних майданчиках великий вибір автомобілів з пошкодженнями після граду, крадіжки, вандалізму тощо.',
        'Ціни на ринку авто в США, як вживаних так і нових, загалом нижчі, ніж у Європі та Україні.',
        'Усі автомобілі в США застраховані в обов`язковому порядку. Коли авто потрапляє в ДТП, як правило, страхова компанія відшкодовує збитки власнику і виставляє автомобіль на страховий аукціон.',
        'Страховий бізнес у США перебуває зовсім на іншому рівні і, як наслідок, іноді, через специфіку законів, ',
        'Крім того, податкові ставки на розмитнення авто в Україні з 2017 року дають змогу дуже вигідно ввозити та розмитнювати автомобілі 2011-2021 року випуску зі США.'
      ]
    },
    {
      show: false,
      question: 'У чому перевага ринку автомобілів у США порівняно з українським ринком?',
      answer: [
        'По-перше - ціна. Усі авто, які завезені зі США та відновлені, продаються на вторинному ринку України в середньому з націнкою 15%-35% від витрачених коштів на це авто.',
        'По-друге - стан. Реалії сьогоднішнього вторинного ринку такі, що 80% автомобілів на ринку України 2011-2021 року випуску були привезені зі США. Відповідно, були куплені на страхових аукціонах, з тими чи іншими пошкодженнями. Розбіг ціни на одну й ту саму модель з однаковими характеристиками на аукціоні та на вторинному ринку України може відрізнятися в рази.',
        'З чим пов`язана така ситуація? На вартість лота на аукціоні впливають такі чинники:',
        '- ступінь пошкоджень',
        '- історія автомобіля',
        '- пробіг',
        '- інші нюанси',
        'Відповідно, "автобізнесмени" прагнуть купити авто за нижчою ціною. Як правило, ці авто мають досить серйозні пошкодження, великий пробіг або інші "підводні камені".',
        'Далі, природньо, йде процес відновлення. Тут також величезний розбіг і вартість відновлення залежить від таких факторів:',
        '- застосованих запчастин (неоригінальні або дефектні запчастини часом у 3-4 рази дешевші за оригінальні)',
        '- якості роботи',
        '- заміни або відновлення (як альтернатива) тих чи інших вузлів.',
        'Звісно, з метою економії, процес відновлення автомобіля не проводиться належним чином. У підсумку, дуже часто, на продаж виставляються неякісно відновлені автомобілі після серйозних ДТП. Іноді, сліди неякісного ремонту не приховати, однак, дуже часто, це неможливо діагностувати під час огляду авто.',
        'Наслідки купівлі такого авто на українському ринку плачевні і як правило тягнуть за собою:',
        '- небезпечні автомобілі',
        '- фінансові витрати в перші півроку експлуатації авто.',
        '- великі проблеми і фінансові втрати при подальшому продажі автомобіля',
        'У разі ж, коли Ви купуєте авто з аукціону, ви отримуєте:',
        '- більший вибір',
        '- можливість самим визначити допустимі пошкодження',
        '- впевненість у рідному пробігу і чистій історії',
        '- можливість викупити авто за вигідною ставкою',
        '- консультації наших експертів щодо ступеня пошкоджень того чи іншого лота',
        '- можливість якісно відновити авто без шкоди для безпеки і надійності Вашого транспортного засобу',
        'По-третє - комплектація. За рахунок високого рівня життя в США та більшої купівельної спроможності, автовиробники постачають на ринок США автомобілі в кращих комплектаціях, порівняно з такими ж автомобілями в Європі та Україні.',
        'По-четверте - рідний пробіг і прозора історія. Абсолютно нормальною практикою в Україні є "скручування" пробігу на автомобілі перед продажем. Ця процедура коштує копійки, а законодавчо відсутня будь-яка реальна відповідальність за такі дії.',
        'У США ситуація зворотна. Існує кримінальна відповідальність за втручання в показання одометра. Та й сам менталітет американців не передбачає навіть думки про скручування пробігу. Завдяки офіційним базам США, всі показання одометра фіксуються під час кожного технічного огляду авто. Будь-яка невідповідність по пробігу авто відразу фіксується. За рахунок цього, під час купівлі автомобіля зі США, можна бути на 100% впевненим у рідному пробігу.',
        'Також величезним плюсом є те, що в США досить маленькі пробіги, на відміну від Європи. Це дає можливість вибрати хоч і 5-7 річний авто, але з мінімальним пробігом.'
      ]
    },
    {
      show: false,
      question: 'Чи можна відмовитися від авто?',
      answer: [
        'Можна, до того, як автомобіль буде виграно на аукціоні. В іншому випадку клієнт втрачає заставний депозит, який вноситься після підписання договору між клієнтом і компанією.'
      ]
    },
    {
      show: false,
      question: 'Навіщо потрібен депозит?',
      answer: [
        'Депозит є страховкою від можливої відмови клієнта від уже придбаного автомобіля або несплати клієнтом купленого лота в обумовлені терміни. Усі аукціони мають систему штрафів у разі відмови або затримки оплати за виграний лот. Депозит дасть змогу покрити витрати компанії в разі невиконання зобов`язань клієнтом.',
        'Депозит повертається клієнту, у разі відмови від купівлі автомобіля до моменту перемоги на торгах.'
      ]
    },
    {
      show: false,
      question: 'Які гарантії?',
      answer: [
        'Ми гарантуємо виконання взятих на себе зобов`язань, прописаних у договорі. Договір поставки транспортного засобу має юридичну силу з моменту підписання обома сторонами і припиняється за фактом виконання всіх зобов`язань з обох сторін.',
        'Згідно з договором, ми несемо матеріальну відповідальність за Ваш вантаж. Вантаж застрахований на всіх етапах доставки до України.'
      ]
    },
    {
      show: false,
      question: 'Чи можливо розмитнити авто у своєму місті самому?',
      answer: [
        'Так, якщо клієнт воліє митнити авто не в порту Одеси, ми доставимо авто в будь-яке інше місто.'
      ]
    },
    {
      show: false,
      question: 'Як ви прораховуєте вартість ремонту за фото? Які гарантії, що ремонт авто не потягне на "кругленьку суму"?',
      answer: [
        'Звичайно, точну вартість ремонту автомобіля оцінити за фотографіями не можна. Однак, ґрунтуючись на багаторічному досвіді в цій справі, наші експерти оцінюють приблизну вартість ремонту з вірогідністю у 80-90 (а часто і 100) відсотків. Також ми завжди рекомендуємо закладати певну суму (яку також визначають наші експерти) на непередбачувані витрати, залежно від класу автомобіля, вартості деталей і характеру пошкоджень.',
        'У процесі підбору ми завжди пропонуємо лоти з максимально зрозумілими пошкодженнями, які максимально точно можна оцінити.',
        'Як показує практика, у підсумку, згідно з такою калькуляцією, економія становить 10-30% від ринкової вартості авто.'
      ]
    },
    {
      show: false,
      question: 'З якими пошкодженнями ви НЕ радите брати автомобілі?',
      answer: [
        'Ми завжди намагаємось максимально сприяти вигідній купівлі справді ХОРОШОГО І БЕЗПРОБЛЕМНОГО авто, проте остаточне рішення залишається завжди за клієнтом.',
        'Ми не радимо купувати утопленика, автомобілі без видимих ударів/пошкоджень.',
        'Також, ми радимо розглядати автомобілі не старше 8 років, з мінімальним пробігом.',
        'Крім того, ми не радимо купувати СИЛЬНО розбиті авто навіть за умовні "копійки", тому що практика показує, що в процесі ремонту, вся ця економія під час купівлі з аукціону виллється в додаткові ремонтні роботи.'
      ]
    },
    {
      show: false,
      question: 'Чи можна здійснити більш детальний огляд автомобіля на майданчику Вашим представником?',
      answer: [
        'Так, за бажанням клієнта, ми замовимо інспекцію, і представник аукціону зможе зробити детальний фотозвіт пошкоджень конкретного лота. Вартість такої послуги - 100-180 доларів за кожен огляд. Ми рекомендуємо користуватися цією послугою при купівлі преміальних авто, вартість яких на аукціоні США становитиме від 20 000 доларів.'
      ]
    },
    {
      show: false,
      question: 'Який мінімальний бюджет на купівлю авто зі США?',
      answer: [
        'Мінімальний бюджет у районі 6000 $ з урахуванням усіх витрат без урахування ремонту'
      ]
    },
    {
      show: false,
      question: 'Які терміни?',
      answer: [
        'Середній термін отримання авто - 8-10 тижнів з моменту купівлі авто на аукціоні до моменту отримання розмитненого авто у Вашому місті.'
      ]
    },
    {
      show: false,
      question: 'Від чого залежить вартість доставки?',
      answer: [
        'Вартість доставки кожного автомобіля залежить від розташування майданчика аукціону, на якому він знаходиться, а також порту відправки зі США.',
        'Для прорахунку вартості доставки ви можете скористатися калькулятором доставки на нашому сайті.'
      ]
    },
    {
      show: false,
      question: 'Як розрахувати вартість митних платежів?',
      answer: [
        'Сума мит залежить від ціни покупки/року випуску/типу палива/обсягу двигуна кожного конкретного лота.',
        'Для розрахунку вартості митних платежів Ви можете скористатись калькулятором розмитнення на нашому сайті.'
      ]
    }

  ];
  fragment: any = '';
  componentDestroyed$: Subject<boolean> = new Subject();
  scrollPosition = 0;
  constructor(
    public route: ActivatedRoute,
  ) {
    document.addEventListener('scroll', () => {

      this.scrollPosition = window.pageYOffset;
      console.log(this.scrollPosition);
      // this.fragment = '';
      this.keepTrack();
    }, {
      passive: true
    })
  }

  ngOnInit(): void {

    this.scrollToSource.pipe(switchMap(targetYPos =>
      interval(100).pipe( //interval just creates an observable stream corresponding to time, this emits every 1/10th of a second. This can be fixed or make it dynamic depending on the distance to scroll
        scan((acc, curr) => acc + 5, window.pageYOffset), // scan takes all values from an emitted observable stream and accumulates them, here you're taking the current position, adding a scroll step (fixed at 5, though this could also be dynamic), and then so on, its like a for loop with +=, but you emit every value to the next operator which scrolls, the second argument is the start position
        takeWhile(val => val < targetYPos)) // stop when you get to the target
    )).subscribe(position => {
      console.log(position);
      window.scrollTo(0, position);
    }); // here is where you scroll with the results from scan

    this.route.fragment.pipe(
      takeUntil(this.componentDestroyed$)
    ).subscribe(
      (fragment) => {
        console.log(fragment);
        this.fragment = fragment;
      }
    );

    this.currentSection.subscribe(
      (res) => {
        console.log("current section: ", res)
      }
    )

  }

  sliceArr(mode: number, arr: any[]) {
    return mode === 0 ? arr.slice(0, 6) : arr.slice(7, 13);
  }



  keepTrack() {
    const viewHeight = window.innerHeight;
    for (var section of this.sections) {
     const element = document.getElementById(section);
      if (element != null) {
       const rect = element.getBoundingClientRect();
       if (rect.top >= 0 && rect.top < viewHeight / 2)
         {this.currentSection.next(section);}
      }
     }
   }

  getTargetElementRef(currentYPos: any) {
    // you need to figure out how this works
    // I can't comment much on it without knowing more about the page
    // but you inject the host ElementRef in the component / directive constructor and use normal vanillaJS functions to find other elements
  }

  scrollTo(target: ElementRef): void {
    // this assumes you're passing in an ElementRef, it may or may not be appropriate, you can pass them to functions in templates with template variable syntax such as: <div #targetDiv>Scroll Target</div> <button (click)="scrollTo(targetDiv)">Click To Scroll</button>
    this.scrollToSource.next(target);
  }

  ngOnDestroy() {
    this.componentDestroyed$.next(true);
    this.componentDestroyed$.complete();
  }


  //switch map takes the last value emitted by an observable sequence, in this case, the user's latest scroll position, and transforms it into a new observable stream


}
